#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FeatureUICfg_type.BP_STRUCT_FeatureUICfg_type
// 0x0030
struct FBP_STRUCT_FeatureUICfg_type
{
	struct FString                                     BattleEventIDs_0_6D247B8029EC8E1478D50F9D0FC4C063;        // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CategoryID_1_6F4276C07523A563488E820901C29EC4;            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     CategoryName_2_6AC933C06BF94C4519F7015D029F57F5;          // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SlotCount_3_4B40AEC07DA5B30334A437170D303BF4;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     VoiceKey_4_00E30BC07027C15D12EF1AE30E4404A9;              // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                FeatureType_5_11165F802A37C5A86D09A7EA0ACFC375;           // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

