#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FriendMomentBgCfg_type.BP_STRUCT_FriendMomentBgCfg_type
// 0x0040
struct FBP_STRUCT_FriendMomentBgCfg_type
{
	struct FString                                     BackGoundPath_0_68A98480460378BC7C8F6CCB0AF44FC8;         // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BpPath_1_3262D5803EAC9DF24A2C418F00392518;                // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ComboBgPath_3_2B69CF405EDF4D413BFB8E860888CFC8;           // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IconPath_6_1B1F0B403A6D678F1D5D8A08062ED8F8;              // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_7_45DCC9003226D1027E0A5A1F0C4DB074;                    // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Des_11_5FA08CC006273C0D7EC78BF304DB0003;                  // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

