#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TeamUpPopFrame_type.BP_STRUCT_TeamUpPopFrame_type
// 0x0060
struct FBP_STRUCT_TeamUpPopFrame_type
{
	int                                                DefaultDisplay_0_220585C053DEBE9568440FB70B6BF029;        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     DescGet_1_57FE06C07AEC5845715F23AD0273E1D4;               // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DescTime_2_53A0C28040C211483960564307316F15;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Icon_3_04BF61401D70FEBB200A5A1D09C173FE;                  // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_235F024032F89E951FE43C360BA9C154;                    // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     JumpUrl_5_6B7892C04A7323BB3250C999091EC0AC;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_6_50AA3F4021957D0319CFE66409C2CD95;                  // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Skin_7_77C6644067975ED319CE0DDF09C02A5E;                  // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Sort_8_075B490036B06E9C19CE1E4809C02D34;                  // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BeginShowTime_9_570524406235C45B4B58D2440F6BD1B5;         // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

