#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Map_type.BP_STRUCT_Map_type
// 0x00FC
struct FBP_STRUCT_Map_type
{
	struct FString                                     MapName_0_99C86D5F4EEAC838D927A895ABB469F4;               // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ResId_3_6A18D49C4C648A6B96E15C9CD0C9406D;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MapPath_2_556AB4C74A5227AA1355AA8C60EF15BB;               // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MiniMapPath_7_626C20754C65FDF1DF3BE882DFD06DB2;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowImg_9_997F417E43ACA5F7ADE34991024B8A47;               // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MainMode_10_F894E3F44BC17997549883BAE6037772;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WatchingName_22_1E163A80197C082E6ED9EA62071623F5;         // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                minimapscale_25_4D9A69C02EE150831A1405BB03C31435;         // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsFpp_26_2FEF658020791EA605663E18029811B0;                // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsObEnable_27_3C343A000A4AE4D404D752C60AADFBB5;           // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsSingleValid_28_237210807451A52237EF47D40A4944A4;        // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsTeamValid_29_01F3B9C04B9B6A5D6461122F06B4A484;          // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsDoubleValid_30_3E486EC02BC356FD5EE53D960ABBEBD4;        // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RoomModeId_31_0A7DE0C045E9C26D13A178350E2CBD54;           // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MapKey_34_7C1F1EC057F596C138AC113C09BE9DE9;               // 0x0068(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MapImage_37_5B95AD4015935BF959B4DDB00E841E65;             // 0x0074(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShowName_38_0FA0B58004CBF1EE4DD372DE09A86F25;             // 0x0080(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DebugAI_Num_39_6706ED00455805583339F7C509DDF0CD;          // 0x008C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             DeathReplayConfig_as_40_2DB7C4004600B556401B450008A1FF43; // 0x0090(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RersultAvatarLevel_41_385FFF0064C51EE42E74DC0802F052BC;   // 0x009C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ResultPoseSeq_Double_42_16B66B4029DF893D58B88E2B0F643505; // 0x00A8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ResultPoseSeq_Four_43_33E2FB8018431B622C0CEB100C2F4442;   // 0x00B4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     DefaultWeatherLevel_44_797D304037CFC8310E17E4C007790CEC;  // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeatherIds_45_59D0C900081800187E44747406C532F3;           // 0x00CC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeatherLevels_46_049C5BC06952395B73716DAD04F8A863;        // 0x00D8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WeatherWeights_47_59DCF7C042A109616C35015900F91A93;       // 0x00E4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     MiniMapPathCN_48_6BCC7F40497B326D5F5A5F0F0EC08D6E;        // 0x00F0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

