#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class HiggsBoson.ClientGlueHiaSystem
// 0x0188 (0x01A8 - 0x0020)
class UClientGlueHiaSystem : public UWorldSubsystem
{
public:
	unsigned char                                      UnknownData00[0x17C];                                     // 0x0020(0x017C) MISSED OFFSET
	int                                                ParamWall01;                                              // 0x019C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x01A0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.ClientGlueHiaSystem");
		return pStaticClass;
	}


	bool IsTimeNearInvalidMoveState(class AActor* CharacterPtr, float TimeInSeconds, float MarginInSeconds);
	bool IsGMCheatingSpeed(class AActor* CharacterPtr);
};


// Class HiggsBoson.FuzzyObject
// 0x0264 (0x0280 - 0x001C)
class UFuzzyObject : public UObject
{
public:
	unsigned char                                      UnknownData00[0x258];                                     // 0x001C(0x0258) MISSED OFFSET
	int                                                Param1;                                                   // 0x0274(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0278(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.FuzzyObject");
		return pStaticClass;
	}


	bool SetUInt8ValueByName(const struct FString& Name, unsigned char Value);
	bool SetUInt64ValueByName(const struct FString& Name, uint64_t Value);
	bool SetUInt32ValueByName(const struct FString& Name, uint32_t Value);
	bool SetUInt16ValueByName(const struct FString& Name, uint16_t Value);
	bool SetInt8ValueByName(const struct FString& Name, int8_t Value);
	bool SetInt64ValueByName(const struct FString& Name, int64_t Value);
	bool SetInt32ValueByName(const struct FString& Name, int Value);
	bool SetInt16ValueByName(const struct FString& Name, int16_t Value);
	bool SetFloatValueByName(const struct FString& Name, float Value);
	bool SetBoolValueByName(const struct FString& Name, bool Value);
	bool GetUInt8ValueByName(const struct FString& Name, unsigned char* OutValue);
	bool GetUInt64ValueByName(const struct FString& Name, uint64_t* OutValue);
	bool GetUInt32ValueByName(const struct FString& Name, uint32_t* OutValue);
	bool GetUInt16ValueByName(const struct FString& Name, uint16_t* OutValue);
	bool GetInt8ValueByName(const struct FString& Name, int8_t* OutValue);
	bool GetInt64ValueByName(const struct FString& Name, int64_t* OutValue);
	bool GetInt32ValueByName(const struct FString& Name, int* OutValue);
	bool GetInt16ValueByName(const struct FString& Name, int16_t* OutValue);
	bool GetFloatValueByName(const struct FString& Name, float* OutValue);
	bool GetBoolValueByName(const struct FString& Name, bool* OutValue);
};


// Class HiggsBoson.SCoronaClientData
// 0x0000 (0x0280 - 0x0280)
class USCoronaClientData : public UFuzzyObject
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.SCoronaClientData");
		return pStaticClass;
	}

};


// Class HiggsBoson.CamoyoHelper
// 0x0004 (0x0020 - 0x001C)
class UCamoyoHelper : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.CamoyoHelper");
		return pStaticClass;
	}


	static void MakeRectTu(const struct FScriptDelegate& CamoyoRetDelegate, const struct FString& Filename, int Quality, bool bShowUI);
	static void MakeMemPerform(int InbOpen);
	static void MakeFitRectTu(const struct FScriptDelegate& CamoyoRetDelegate, const struct FVector4& InCutParam, int InTuType, bool isShowUI);
};


// Class HiggsBoson.HiggsBosonComponent
// 0x0888 (0x09D8 - 0x0150)
class UHiggsBosonComponent : public ULuaActorComponent
{
public:
	unsigned char                                      UnknownData00[0x10C];                                     // 0x0150(0x010C) MISSED OFFSET
	struct FString                                     TraceData;                                                // 0x025C(0x000C) (ZeroConstructor)
	struct FString                                     GameTraceData;                                            // 0x0268(0x000C) (ZeroConstructor)
	uint32_t                                           HeartBreaks;                                              // 0x0274(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     HeartInfo;                                                // 0x0278(0x000C) (ZeroConstructor)
	struct FScriptMulticastDelegate                    OnSwiftHawkDelegate;                                      // 0x0284(0x000C) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnGlueHiaRayResult;                                       // 0x0290(0x000C) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class ASTExtraBaseCharacter*                       CharacterOwner;                                           // 0x029C(0x0004) (ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerController*                    PlayerController;                                         // 0x02A0(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bClientInfoReceived;                                      // 0x02A4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x02A5(0x0003) MISSED OFFSET
	TArray<uint32_t>                                   ClientInfoAsUInt32Array;                                  // 0x02A8(0x000C) (ZeroConstructor)
	TArray<unsigned char>                              IntegrityItemCheckResultAsBytes;                          // 0x02B4(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x34];                                      // 0x02C0(0x0034) MISSED OFFSET
	bool                                               bRoofTouchActive;                                         // 0x02F4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0xB];                                       // 0x02F5(0x000B) MISSED OFFSET
	int                                                RoofTouchStatus;                                          // 0x0300(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x614];                                     // 0x0304(0x0614) MISSED OFFSET
	class USCoronaClientData*                          SecurityCoronaLabClientDataPointer;                       // 0x0918(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xBC];                                      // 0x091C(0x00BC) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.HiggsBosonComponent");
		return pStaticClass;
	}


	void UpdateFeiji(float Param1);
	void SyncServerParam(bool Param1);
	void SwiftHawk(TArray<unsigned char> Hawks, uint32_t Magic);
	void ShowSecurityAlertInDev(const struct FString& Message, bool bIsClientShowWindow, bool bIsServerReportRobot, bool bIsSimilarMessageReportOnlyOnce);
	void SetSchemeForInitialize(int Index, uint32_t VerifyLen, TArray<unsigned char> VerifyHashArray, TArray<struct FPatchPoint> PatchPointArray);
	void SetSchemeForGet(int Index, uint32_t VerifyLen, TArray<unsigned char> VerifyHashArray, TArray<struct FPatchPoint> PatchPointArray);
	void ServerWheat(float Param1, float Param2, float param3, float Param4, float Param5, float Param6, float Param7, float Param8, float Param9);
	void ServerPoPo(TArray<unsigned char>* Array);
	void RPC_ServerGlueHiaPark(int8_t HeShui, TArray<unsigned char> GlueHiaParkArr, uint32_t HiaStatus, TArray<unsigned char> GlueArg, TArray<unsigned char> GlueHiaParkArr2, uint32_t HiaStatus2);
	void RPC_ServerCapbo(int8_t BoCapC, int8_t InBoType, TArray<unsigned char> BoDataArr);
	void RPC_ClientCoronaLab(unsigned char bAllSwitch, TArray<unsigned char> CoronaLab, uint32_t CoronaState);
	void OnWeaponAimInput(float InDistToEnemy, float InYaw, float InPitch, float InRoll);
	void OnTouchInput(float InYaw, float InPitch, float InRoll);
	void OnStopFireEvent();
	void OnStartFireEvent();
	void OnSkillInteruptVisual(class AActor* InTarget, class AActor* InCauser);
	void OnSkillEndVisual(class AActor* InTarget, class AActor* InCauser);
	void OnSkillEndTrans(class AActor* InTarget, class AActor* InCauser);
	void OnSkillBeginVisual(class AActor* InTarget, class AActor* InCauser);
	void OnSkillBeginTrans(class AActor* InTarget, class AActor* InCauser);
	void OnPlayerScopeOut(bool bBegan);
	void OnPlayerScopeIn(bool bBegan);
	void OnMyPawnRespawn(class AUAEPlayerController* InPlayerController);
	void OnKillSomeOneEvent(class AActor* InSomeOne);
	void OnGyroInput(float InYaw, float InPitch, float InRoll);
	void OnClientAdjustPosition(const struct FVector& NewLoc, ECharacterMoveDragReason Reason);
	void OnCapboReturn(int BoCapC, int InBoType, TArray<unsigned char> RetData);
	void OnBulletImpactEvent(class AActor* InCauser, const struct FHitResult& InImpactResult);
	void HandleClientReconnect();
	float GetServerGuey();
	void FlushGameEnd();
	void EnableEnhancedDynamicActors(int Index);
	void DispatchIntegrityCheckItem(uint32_t PlatID, uint32_t AreaID, uint32_t GameBits, uint32_t Index, int Offset, uint32_t Len, uint32_t Type);
	void ControlRoofTouch(int Switch);
	void ClientSwiftHawkWithParams(TArray<unsigned char> Hawks);
	void ClientSwiftHawk(unsigned char Type, int SequenceID);
	void ClientReceiveEx(TArray<unsigned char> RPCConstArray);
	void ClientDoJT(bool bDelayUntilShot);
};


// Class HiggsBoson.TickAsTimer
// 0x0004 (0x0020 - 0x001C)
class UTickAsTimer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.TickAsTimer");
		return pStaticClass;
	}

};


// Class HiggsBoson.TimeConsuming
// 0x0004 (0x0020 - 0x001C)
class UTimeConsuming : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class HiggsBoson.TimeConsuming");
		return pStaticClass;
	}

};


}

