#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass SK_WEP_M416_AnimBP.SK_WEP_M416_AnimBP_C
// 0x02E0 (0x0680 - 0x03A0)
class USK_WEP_M416_AnimBP_C : public UWeaponAnimInstanceBase
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03A0(0x0004) (Transient, DuplicateTransient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03A4(0x0004) MISSED OFFSET
	struct FAnimNode_Root                              AnimGraphNode_Root_B7FBE3A14BF1790E725C1FAD5B729681;      // 0x03A8(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4F3B9EF433A4BF183431B882C8B6CBA;// 0x03E0(0x0038)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DBF5C9FE49CCDA52042A0CBA453258BB;// 0x0418(0x0038)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9C75EB044F253338DE9CCA940AE68844;// 0x0450(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E53306243BB8EEF8A66E2954B605AE2;// 0x04B0(0x0038)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11B8DD4F43558B51BA6C9181D3465E2D;// 0x04E8(0x0060)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DA43943D4A76C179F483ADADB012B51B;// 0x0548(0x0038)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_344EBB0E4AD7C89A485D84B82399E97D;// 0x0580(0x00A8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_163652544349750545F55EBE5F84D217;      // 0x0628(0x0058)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("AnimBlueprintGeneratedClass SK_WEP_M416_AnimBP.SK_WEP_M416_AnimBP_C");
		return pStaticClass;
	}


	void HandleWeaponStateChanged(TEnumAsByte<EFreshWeaponStateType> Selection);
	void PlayFireAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_WEP_M416_AnimBP_AnimGraphNode_TransitionResult_DBF5C9FE49CCDA52042A0CBA453258BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_WEP_M416_AnimBP_AnimGraphNode_SequencePlayer_9C75EB044F253338DE9CCA940AE68844();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_WEP_M416_AnimBP_AnimGraphNode_TransitionResult_A4F3B9EF433A4BF183431B882C8B6CBA();
	void OnWeaponChangeState(TEnumAsByte<EFreshWeaponStateType> CurState);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_SK_WEP_M416_AnimBP(int EntryPoint);
};


}

