#pragma once

// PUBG MOBILE 2.4.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_DownloaderTable_type.BP_STRUCT_DownloaderTable_type
// 0x0034
struct FBP_STRUCT_DownloaderTable_type
{
	struct FString                                     BundleContent_0_1AACD08017EAD48E3276DC230B38BEB4;         // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BundleIcon_1_59383C0037BF3F0634905A63016ECF8E;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                BundleID_2_406A9D004C9B983857CE26E707D16EE4;              // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BundleName_3_25231A005CD41C383490E2A8016F71E5;            // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                IsHighLight_4_13F750403E6563A927DAF90709585AA4;           // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsHot_5_2BF2DD002B4BB81859F58605048AA8C4;                 // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsFold_10_3C1833803EFE81B60CDA940008AA7064;               // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

