#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_IntimacyLevel_type.BP_STRUCT_IntimacyLevel_type
// 0x0014
struct FBP_STRUCT_IntimacyLevel_type
{
	int                                                Level_0_54F611001D596F340030895701A822CC;                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxExp_1_5EFBC7C050190E932F5853C00A962BE0;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MinExp_2_4621874016AB038529E2C3FA0A92CBE0;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_3_1AD816402E08282F322819440EE71974;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Number_4_2D526D407E0CC6ED383562640AF6DFD2;                // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

