#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SuitDyePart_type.BP_STRUCT_SuitDyePart_type
// 0x0031
struct FBP_STRUCT_SuitDyePart_type
{
	struct FString                                     ChangeCost_0_0FA254C0779499277051C22E04B06B34;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_4DE34040418E994F2D0A457A03F06984;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PartName_2_09ADE30011A0C53623B194970B693005;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                PartNo_3_4CA1D20060DD89C2267DE0FD083B692F;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PartParamIDs_4_7E61BF001A141FE663CE2AA000BD74B3;          // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Period_5_0EE975C010E3A28726084B1E083F8034;                // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTurnAround_6_76A35A003DD9B92A2BD64E7A043BE9D4;           // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

