#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UGCAssetConfig_type.BP_STRUCT_UGCAssetConfig_type
// 0x0054
struct FBP_STRUCT_UGCAssetConfig_type
{
	int                                                AssetID_0_6C1CB6005152E2225E501F6100A93244;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Desc_1_4A0392802C18CB063DA2123E0FA92C93;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_4_5F44160067247D64681C18D9000FA954;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name_5_03E393000E13964C3DBD91440FAAC835;                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        ResArray_a_6_4341AD00601787C843D1519007308321;            // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ResSeprateType_7_1E557AC007537C097EC0E2E7042CEFE5;        // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     HDIcon_8_674B1800689BD6DA2E2595D20948F7FE;                // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Icon_9_37F8B50009EF18043DB023720FA97A5E;                  // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FString>                             DependBundleArray_as_10_797669C001963C1D601E4B0701B83DB3; // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

