#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass BP_LobbyWeapon.BP_LobbyWeapon_C
// 0x0060 (0x0950 - 0x08F0)
class ABP_LobbyWeapon_C : public ASTExtraLobbyWeapon
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x08F0(0x0004) (Transient, DuplicateTransient)
	class UWeaponAvatarComp_BP_C*                      WeaponAvatarComp_BP;                                      // 0x08F4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHoldBack;                                                // 0x08F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x08F9(0x0003) MISSED OFFSET
	TMap<struct FString, struct FTransform>            WeaponAttachRelativeTransformMap;                         // 0x08FC(0x0050) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                               WeaponMeshAndMatLoaded;                                   // 0x0938(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WeaponAnimLoaded;                                         // 0x0939(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x093A(0x0002) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponAllAssetsLoaded;                                  // 0x093C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	bool                                               ForbiddenWeaponIdleAnim;                                  // 0x0948(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0949(0x0003) MISSED OFFSET
	int                                                ShowType;                                                 // 0x094C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("BlueprintGeneratedClass BP_LobbyWeapon.BP_LobbyWeapon_C");
		return pStaticClass;
	}


	void HandleIdleAnim();
	void OnDependentWeaponLoaded();
	void SetForceForbideIdleAnim();
	void RequestWeaponDIYData(const struct FString& PlayerUID, int WeaponAvatarID, int DIYPlanID);
	void EquipWeaponPandentByPandentId(int pendantID, EWeaponPendantSocketType PendantSocketType);
	void OnAsyncLoadLobbyWeaponAnimDone();
	void CheckWeaponAssetsAllLoaded();
	void ResetWeaponLoadedStatus();
	void OnAsyncLoadLobbyWeaponMeshDone();
	struct FTransform GetWeaponAttachToBackRelativeTransformByBagLevel_Lobby(int* Level, int* SideType);
	void InitMesh(class UBattleItemHandleBase* Handle);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void BPBeginPlay();
	void ExecuteUbergraph_BP_LobbyWeapon(int EntryPoint);
	void OnWeaponAllAssetsLoaded__DelegateSignature(class ABP_LobbyWeapon_C* BPLobbyWeapon);
};


}

