#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SocialCardBGInfo_type.BP_STRUCT_SocialCardBGInfo_type
// 0x0068
struct FBP_STRUCT_SocialCardBGInfo_type
{
	int                                                AcquiSitionMethod_0_339212807F5DA0002A68EC4D02714F64;     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     AcquiSitionMethodLink_1_1276F6000D8B818C7D77592B0F6B5F0B; // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                DispalySortInfo_2_50D8C280275B67C671578BF404337B9F;       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_3_0965E34004C0477B4151D50C0D8CDA74;                    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsShow_4_364157406983E6557AEEA7420BA513B7;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     MainUMG_5_52097B801C469C4E6422F27709A8F5A7;               // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PersonInfoBGUMG_6_69BADD4028ACB3792ECDDE3D0E5F5E47;       // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     remarks_7_5E463D4018B32F2B0C0754A4027B46B3;               // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SocialCardBGName_8_3EBEB7C0735C26356591A92C0BD198A5;      // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     StartDisplayTimeOfAcquisitionPath_9_33DD2F801DC27D3E650AC15E041A6598;// 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     UserTimeInfo_10_3BD64E807B4117B6096E615A055DCFBF;         // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                CanLoop_11_3D2E8B005FB65BD0223ED4EA03BBF9C0;              // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

