#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SuitDyePartParam_type.BP_STRUCT_SuitDyePartParam_type
// 0x003C
struct FBP_STRUCT_SuitDyePartParam_type
{
	int                                                AvatarSlotID_0_74ADBCC01F8D9CB30A170F2A0DC2F3E4;          // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_1_71EEDC8072B10144186DBCF30F11BA74;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MatSlotID_2_6699CD804E6B52180A143195089AD1A4;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ParamName_3_6AA0B5C04D4DED6D71357326097BFC45;             // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     HighLightParamName_4_5426B3C0254C6ED15DAE8BB90DFF2025;    // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SwitchParamName_5_2CDB3240626C80ED717FBED809D42285;       // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CloseMaskParamName_6_458D164037754B29126E371201CA3A85;    // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

