#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass LobbyWeaponAnimationActor.LobbyWeaponAnimationActor_C
// 0x0018 (0x0320 - 0x0308)
class ALobbyWeaponAnimationActor_C : public AActor
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0308(0x0004) (Transient, DuplicateTransient)
	class USkeletalMeshComponent*                      SkeletalMesh;                                             // 0x030C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             DefaultSceneRoot;                                         // 0x0310(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                WeaponMontage;                                            // 0x0314(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                DelayTime;                                                // 0x0318(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                TotalTime;                                                // 0x031C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("BlueprintGeneratedClass LobbyWeaponAnimationActor.LobbyWeaponAnimationActor_C");
		return pStaticClass;
	}


	void PlayLobbyAnimation();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnAnimEnd(class UAnimMontage* Montage, bool bInterrupted);
	void SetAnimTimeInfo(int DelayTime, int TotalTime);
	void ExecuteUbergraph_LobbyWeaponAnimationActor(int EntryPoint);
};


}

