#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SuitDyeCfg_type.BP_STRUCT_SuitDyeCfg_type
// 0x0038
struct FBP_STRUCT_SuitDyeCfg_type
{
	int                                                ID_0_6DA99E8036458D3C7CD46C6F09A6BFE4;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_1_37B739400C3571E94A95958B0C0156DC;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PartIDs_2_1F6D410078AD02C6709660670513E653;               // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Period_3_5CE3540035A7562C3704167E0E552AE4;                // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PlanIDs_4_75491E002E0778DE3D73A10F06BE4653;               // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SuitID_5_201DC7C00AC07DCB7CC7DE100E93AE64;                // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     UpgradeCost_6_474D13802E02CC863E11050C0C467244;           // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                OpenSeason_7_157B7A0022BFE82036A3B433055BD77E;            // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

