#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_DragonChangeFormConfig_type.BP_STRUCT_DragonChangeFormConfig_type
// 0x0014
struct FBP_STRUCT_DragonChangeFormConfig_type
{
	int                                                ActionID_0_120F63003B070CB401D3F5780467C854;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                AfterClothID_1_378FA680559474122D241D5804B5C954;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BeforeClothID_2_65201EC00CB4CB09120200B90F875AE4;         // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ID_3_49EECB801F3AE2E65334111D0EC9EA24;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Priority_4_7D04C0C07767DF67795BA9CA064F7B39;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

