#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RecommendDelete_type.BP_STRUCT_RecommendDelete_type
// 0x0028
struct FBP_STRUCT_RecommendDelete_type
{
	int                                                ID_0_086B8400728145E4295143780ED1FFD4;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nActDay_1_5ED509C054F4D2FD43415E1602979569;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nCondition1_2_49EB9240540319512D0C230506E88D41;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nCondition2_3_49EC9280540319522D0C230406E88D42;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nCycleDay_4_63BF7FC049CBBEC95915A934029D78C9;             // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nDeleteAll_5_10C1974050B4C62B6C0F63D60334B45C;            // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                nMapTimeLimte_6_304CA6407A10DBB56A9AA1EC0057C185;         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     sDeleteData_7_38EE70C019CC767F190FECBD036EEF91;           // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

