#pragma once

// PUBG MOBILE 2.7.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ClothingStateConfig_type.BP_STRUCT_ClothingStateConfig_type
// 0x0028
struct FBP_STRUCT_ClothingStateConfig_type
{
	struct FString                                     DetailIcon_0_790460404C6C98513F2D40CE0575B25E;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                NewClothID_1_7C6DF580783D2B4C2A01FA4E0CC004C4;            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                OriginClothID_2_3653A50027DBF40E540F41B402F35B94;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                State_3_3255A98004D1663E790C77840944E285;                 // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StateName_4_6CF4E9C00CBE0D5B58EE403F028104D5;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     WardrobeIcon_5_2C21D900529AC976547A36DB01B5D17E;          // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

