#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_LoginTypeListCfg_type.BP_STRUCT_LoginTypeListCfg_type
// 0x0050
struct FBP_STRUCT_LoginTypeListCfg_type
{
	int                                                vk_1_4D150F800FF7457E47A4BBF80A4FE97B;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                facebook_2_6B5EE5C01DC298954FEE67540DD47E2B;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                guest_3_1C3541407226F6AB70CC647C0E851854;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     RegionDesc_5_52ADF00018ED72103BEE907D01C99D03;            // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                twitter_6_799D3C006ADF4D8C6E24EE0600844452;               // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                line_7_2BC341400AC147413DEA00130FE99605;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ID_8_09129A803217EE9447A481C60A4FEA64;                    // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gpgc_9_7B1D3F8001ADAE6A15FF865F0FE85C93;                  // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                hms_10_25A7A9407D8C1CB161DD507B04FE86E3;                  // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Language_11_6FFD20403D96047D07ADE9370E015C45;             // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                index_12_6814DD4001A91F8370ECD0960E85EE38;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                discord_13_754FF1405DEEB00D01CE6D8F02AD7804;              // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                green_14_1E351B805F825F0A70CC14B00E852F4E;                // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                term_022_15_304FA20033059FC83179DAAA06DECA42;             // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

