#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CarteFrameConfig_type.BP_STRUCT_CarteFrameConfig_type
// 0x0061
struct FBP_STRUCT_CarteFrameConfig_type
{
	bool                                               bShow_0_1FBCB2406382B1A56BCE1717024D9317;                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ShowIndex_2_20C917C01A95C17F358E22CC0ACE3938;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SkinID_3_17899A00247F841600FAF970074145F4;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SkinPath_4_73C37A00682C77386BDC4A5A01444FE8;              // 0x000C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SourceDesc_5_04CCAD805375C8A00E3F819F0FBEEA93;            // 0x0018(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SourceJumpUrl_6_4928E18073EB06F83A7C3FFB05E4A77C;         // 0x0024(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SourceShowTime_7_6FFCD9C0657FB55F173E6978096313E5;        // 0x0030(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TimeDesc_8_057DB5000F1369F27075820100FE8B83;              // 0x003C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EffectBP_10_0BE929401F1CD22B400CDAD60C0C8E60;             // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     RoleInfoEffectBP_11_2C0350C010EFC90B4D745A4D022FAD20;     // 0x0054(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bLoopAnim_12_21EDF1C06DA3CCE559A41E900A1649CD;            // 0x0060(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

