#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Spectating.OBHttpComponent
// 0x0048 (0x0198 - 0x0150)
class UOBHttpComponent : public ULuaActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0150(0x0008) MISSED OFFSET
	TArray<struct FPlayerAfterMatchAPI>                AfterMatchAPIList;                                        // 0x0158(0x000C) (Net, ZeroConstructor)
	bool                                               bSwitchOBHttpComponent;                                   // 0x0164(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0165(0x0003) MISSED OFFSET
	struct FString                                     IPAddr;                                                   // 0x0168(0x000C) (ZeroConstructor, Config)
	int                                                Port;                                                     // 0x0174(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	struct FString                                     URLSetting;                                               // 0x0178(0x000C) (ZeroConstructor)
	int                                                MaxFailedTimes;                                           // 0x0184(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	TArray<int>                                        NeedItems;                                                // 0x0188(0x000C) (ZeroConstructor, Config)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0194(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class Spectating.OBHttpComponent");
		return pStaticClass;
	}


	void ServerGetBackPackInfo(int TeamID, TArray<int> ObserveReplicateItems);
	void ServerGetAllPlayerThrowInfo();
	void ServerCollectTeammateItemList(int TeamID);
	void PostTeamWeaponInfo(const struct FString& TeamWeaponInfoJsonStr);
	void PostTeamBackPackInfoByTeamID(int TeamID, TArray<int> ObserveReplicateItems);
	void OnRep_RealTimeAPIList();
	void OnRep_AfterMatchAPIList();
	void ClientUpdateTeammateItemList();
	void ClientGetBackPackInfo(TArray<struct FPlayerBackPackInfo> TeamBackPackInfo);
	void ClientGetAllPlayerThrowInfo(TArray<struct FPlayerThrowInfo> AllPlayerThrowInfo);
};


// Class Spectating.ObserverProbeComponent
// 0x0098 (0x0158 - 0x00C0)
class UObserverProbeComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x54];                                      // 0x00C0(0x0054) MISSED OFFSET
	TArray<class ABaseAIController*>                   MLAIControllerList;                                       // 0x0114(0x000C) (ZeroConstructor)
	TArray<class ASTExtraPlayerController*>            APIControllerList;                                        // 0x0120(0x000C) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x18];                                      // 0x012C(0x0018) MISSED OFFSET
	class AUAEGameMode*                                OwnerGameMode;                                            // 0x0144(0x0004) (ZeroConstructor, IsPlainOldData)
	class ASTExtraGameStateBase*                       CachedGameState;                                          // 0x0148(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x014C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class Spectating.ObserverProbeComponent");
		return pStaticClass;
	}

};


// Class Spectating.OBSubSystem
// 0x0000 (0x0020 - 0x0020)
class UOBSubSystem : public UWorldSubsystem
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class Spectating.OBSubSystem");
		return pStaticClass;
	}

};


}

