#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CycleMemoryCfg_type.BP_STRUCT_CycleMemoryCfg_type
// 0x005C
struct FBP_STRUCT_CycleMemoryCfg_type
{
	struct FString                                     EffectLink_0_41179A8006C7EE6C251563420C521DDB;            // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_5B47A7004DF54A940ADBC4160F57F954;                    // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ItemDesc_2_6C4187405110E23B69E0FF9F05F65613;              // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ItemId_3_478ED2C06E31B747533417EE0A85F604;                // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ItemName_5_262187C079F65F0169EBA34605F7BEB5;              // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ItemType_6_7CEDF0005C5CC8AC69E8E28A05F55AE5;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SeasonMatchID_7_56B55C802339DBFA09EB8AB002C76764;         // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SeasonYearID_8_70CCC58025D7D3D66A8F3AA80BEF5964;          // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SoundLength_9_52DA7E806E264530451577C108AAD198;           // 0x0038(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LockedDescImage_12_687DF0C025A0D42121083050041C16B5;      // 0x0044(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     LockedDescText_13_223EA1402D2F0E1D2CC7D21B064EEEE4;       // 0x0050(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

