#pragma once

// PUBG MOBILE 2.5.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_UGCAuthorLevelConfig_type.BP_STRUCT_UGCAuthorLevelConfig_type
// 0x0038
struct FBP_STRUCT_UGCAuthorLevelConfig_type
{
	int                                                AlbumMaxNum_0_4B84BF403F93AEE757B260110334567D;           // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Level_1_52184B80082F14782E394D4D031E66BC;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Icon_3_30DBEFC0796CDD3341E4862D003034FE;                  // 0x0008(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name_4_7CC6CDC031F2EE2B41E514B600318E95;                  // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                EditModMaxNum_5_74216C8075E1CC2625D8D392002264DD;         // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PublishModMaxNum_6_5FD020C04EB5A3BF2E6AC34C0C0056DD;      // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ViewPicMaxNum_7_20CEB0C0514E6A434FC91047086E105D;         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     BgImage_8_6F9C90806450546622EF21EE041634D5;               // 0x002C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

