#pragma once

// PUBG MOBILE 2.4.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass wingmanAnimationBP_DT.wingmanAnimationBP_DT_C
// 0x00FC (0x03EC - 0x02F0)
class UwingmanAnimationBP_DT_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x02F0(0x0004) (Transient, DuplicateTransient)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02F4(0x0004) MISSED OFFSET
	struct FAnimNode_Root                              AnimGraphNode_Root_2C92ABEF44108DF4306768A9A8900956;      // 0x02F8(0x0038)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_94AB669544B9B14331BD1DBCC1F1B588;// 0x0330(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8CFE89D84A15090307F81DAECC426213;      // 0x0390(0x0058)
	class UAnimMontage*                                NewVar_1;                                                 // 0x03E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("AnimBlueprintGeneratedClass wingmanAnimationBP_DT.wingmanAnimationBP_DT_C");
		return pStaticClass;
	}


	void BlueprintBeginPlay();
	void ExecuteUbergraph_wingmanAnimationBP_DT(int EntryPoint);
};


}

