#pragma once

// PUBG MOBILE 2.4.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ItemAttrs_type.BP_STRUCT_ItemAttrs_type
// 0x000A
struct FBP_STRUCT_ItemAttrs_type
{
	bool                                               CannotManualDrop_0_0E61A2402E96D7E519F01EB60A948770;      // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Id_1_3F8638004A8D0C9628CCDB940E749B64;                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               NotAddInTombBox_2_089BB7C052749B513D7FACBB06702BD8;       // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               RespawnNotDrop_3_715016400C714305540785CB07BAA120;        // 0x0009(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

