#pragma once

// PUBG MOBILE 2.4.0 SDK generated by Huy#3877 

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass BP_LobbyWingman.BP_LobbyWingman_C
// 0x0028 (0x03A8 - 0x0380)
class ABP_LobbyWingman_C : public ASTExtraLobbyWingman
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0380(0x0004) (Transient, DuplicateTransient)
	class UWingmanAvatarComp_BP_C*                     WingmanAvatarComp_BP;                                     // 0x0384(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnHallWingmanAnimPlay;                                    // 0x0388(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	float                                              invincible;                                               // 0x0394(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              freq;                                                     // 0x0398(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Speed;                                                    // 0x039C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               isNeedUpdate;                                             // 0x03A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x03A1(0x0003) MISSED OFFSET
	int                                                ShowType;                                                 // 0x03A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("BlueprintGeneratedClass BP_LobbyWingman.BP_LobbyWingman_C");
		return pStaticClass;
	}


	void SetHighLight(float invincible, float freq, float Speed);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void WingmanAvatarEqiuped_Event_1();
	void ExecuteUbergraph_BP_LobbyWingman(int EntryPoint);
	void OnHallWingmanAnimPlay__DelegateSignature();
};


}

